From my test in devplanet: 

gen3/test__helm_hatchery:devplanetv1@cdistest_dev_admin:~/.local/share/gen3/default/test__helm_hatchery$ gen3 tfplan
Running terraform -chdir=/home/devplanetv1/cloud-automation/tf_files-1.0/aws/helm_hatchery/ plan --var-file ./config.tfvars -out plan.terraform
INFO: 16:36:31 - Entering module manifest checks
INFO: 16:36:31 - Module loaded /home/devplanetv1/cloud-automation/tf_files-1.0/aws/helm_hatchery/manifest.json
INFO: 16:36:31 - Moving on with terraform 0.11.x
gen3_aws_run terraform1.2 -chdir=/home/devplanetv1/cloud-automation/tf_files-1.0/aws/helm_hatchery/ plan --var-file=/home/devplanetv1/.local/share/gen3/default/test__helm_hatchery/config.tfvars -out=/home/devplanetv1/.local/share/gen3/default/test__helm_hatchery/plan.terraform 
data.aws_iam_policy_document.hatchery-policy-document: Reading...
data.aws_iam_policy_document.hatchery-policy-document: Read complete after 0s [id=2904655463]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.hatchery-policy will be created
  + resource "aws_iam_policy" "hatchery-policy" {
      + arn         = (known after apply)
      + description = "Allow hathcery to assume csoc_adminvm role in other accounts, for multi-account workspaces"
      + id          = (known after apply)
      + name        = "hatchery-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/csoc_adminvm*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ec2:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Update*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:Get*",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:Delete*",
                          + "dynamodb:CreateTable",
                          + "dynamodb:BatchWrite*",
                          + "dynamodb:BatchGet*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/**"
                      + Sid      = "DynamoDB"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.hatchery-role will be created
  + resource "aws_iam_role" "hatchery-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role created with terraform"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hatchery-service-account"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.hatchery-policy-attach will be created
  + resource "aws_iam_role_policy_attachment" "hatchery-policy-attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "hatchery-service-account"
    }

  # aws_iam_role_policy_attachment.resource-access-attach will be created
  + resource "aws_iam_role_policy_attachment" "resource-access-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSResourceAccessManagerFullAccess"
      + role       = "hatchery-service-account"
    }

Plan: 4 to add, 0 to change, 0 to destroy.